In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score,mean_squared_error,mean_absolute_error

In [3]:
df = pd.read_csv('uber.csv')
df.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

In [4]:
df = df[['fare_amount','pickup_longitude','pickup_latitude','dropoff_longitude','dropoff_latitude','passenger_count']]
df.head()

,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,7.5,-73.999817,40.738354,-73.999512,40.723217,1
1,7.7,-73.994355,40.728225,-73.994710,40.750325,1
2,12.9,-74.005043,40.740770,-73.962565,40.772647,1
3,5.3,-73.976124,40.790844,-73.965316,40.803349,3
4,16.0,-73.925023,40.744085,-73.973082,40.761247,5

In [ ]:
X= df.drop('fare_amount',axis=1)
y= df['fare_amount']

In [10]:
df.dropna()
df = df[ (df['fare_amount']>0) & (df['fare_amount']<500) ] 
df = df[(df['passenger_count']>0) & (df['passenger_count']<6)]

In [11]:
df=df[
(df['pickup_latitude'].between(-90,90)) &
(df['dropoff_latitude'].between(-90,90)) &
(df['pickup_longitude'].between(-180,180)) &
(df['dropoff_longitude'].between(-180,180))

]

In [12]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
fare_amount,194985.0,11.352090,9.899703,0.010000,6.000000,8.500000,12.500000,499.000000
pickup_longitude,194985.0,-72.503246,10.434257,-93.824668,-73.992058,-73.981829,-73.967167,40.808425
pickup_latitude,194985.0,39.920725,6.087689,-74.015515,40.734779,40.752568,40.767147,48.018760
dropoff_longitude,194985.0,-72.515244,10.388934,-75.458979,-73.991400,-73.980090,-73.963661,40.831932
dropoff_latitude,194985.0,39.926614,6.069330,-74.015750,40.733862,40.753045,40.768005,45.031598
passenger_count,194985.0,1.595020,1.151278,1.000000,1.000000,1.000000,2.000000,5.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 194985 entries, 0 to 199999
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   fare_amount        194985 non-null  float64
 1   pickup_longitude   194985 non-null  float64
 2   pickup_latitude    194985 non-null  float64
 3   dropoff_longitude  194985 non-null  float64
 4   dropoff_latitude   194985 non-null  float64
 5   passenger_count    194985 non-null  int64
dtypes: float64(5), int64(1)
memory usage: 10.4 MB